src/InformationRegisters/Спец_СоответствиеОбъектовДляОбмена/Спец_СоответствиеОбъектовДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_СоответствиеОбъектовДляОбмена</name>
  <comment>Регистр для хранения параметров обмена с другими базами</comment>
  <resources>
    <name>ТипПередачи</name>
    <type>
      <types>EnumRef.Спец_ТипыПередачиОбъектовДляОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъектаМетаданныхПриемник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </resources>
  <resources>
    <name>ИмяТабличнойЧастиПриемник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </resources>
  <resources>
    <name>ИмяРеквизитаПриемник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </resources>
  <attributes>
    <name>ПолноеИмяТипаОбъектаМетаданныхИсточник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяТипаОбъектаМетаданныхПриемник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаМетаданныхИсточник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТабличнойЧастиИсточник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизитаИсточник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_СоответствиеОбъектовДляОбмена/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьКрасивуюПанельОтборов();
	Спец_РаботаСФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Спец_РаботаСФормамиКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработкаСобытияОтбора(Элемент, СтандартнаяОбработка = Истина)
	
	Спец_РаботаСФормамиКлиент.ОбработатьСобытиеОтбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбработкаСобытияОтбораВызовСервера(Знач Элемент) Экспорт
	
	Спец_РаботаСФормами.ОбработатьСобытиеОтбора(ЭтотОбъект, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКрасивуюПанельОтборов()
	
	СтруктураПараметровПанели = Спец_РаботаСФормами.НоваяСтруктураПараметровВыводаПанелиКрасивыхОтборов(Элементы.Список,
			Элементы.НастройкаСписка,
			Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	
	СтруктураПараметровПанели.ВывестиКоличествоЗаписей = Истина;
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"База",
			ВидСравненияКомпоновкиДанных.Равно,
			"База");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяОбъектаМетаданныхИсточник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя объекта метаданных (источник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяТабличнойЧастиИсточник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя табличной части (источник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяРеквизитаИсточник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя реквизита (источник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяОбъектаМетаданныхПриемник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя объекта метаданных (приёмник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяТабличнойЧастиПриемник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя табличной части (приёмник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяРеквизитаПриемник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Имя реквизита (приёмник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ПолноеИмяТипаОбъектаМетаданныхИсточник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Полное имя типа объекта метаданных (источник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ПолноеИмяТипаОбъектаМетаданныхПриемник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Полное имя типа объекта метаданных (приёмник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ТипПередачи",
			ВидСравненияКомпоновкиДанных.Равно,
			"Тип передачи");
	
	Спец_РаботаСФормами.ВывестиПанельОтборовНаФорму(ЭтотОбъект, СтруктураПараметровПанели);
	
КонецПроцедуры

#КонецОбласти
